[
  {
    "id": 1,
    "titulo": "Desarrollo Móvil con React Native",
    "descripcion": "React Native es un framework de desarrollo móvil multiplataforma que permite crear aplicaciones nativas para iOS y Android utilizando JavaScript y React. Desarrollado por Facebook, ofrece la ventaja de escribir código una vez y ejecutarlo en múltiples plataformas, manteniendo el rendimiento nativo.",
    "urlImagen": "https://source.unsplash.com/400x300/?programming,mobile",
    "mostrarTodo": false
  },
  {
    "id": 2,
    "titulo": "Fundamentos de JavaScript",
    "descripcion": "JavaScript es un lenguaje de programación interpretado, dialecto del estándar ECMAScript. Se define como orientado a objetos, basado en prototipos, imperativo, débilmente tipado y dinámico. Es fundamental para el desarrollo web moderno y aplicaciones móviles.",
    "urlImagen": "https://source.unsplash.com/400x300/?javascript,coding",
    "mostrarTodo": false
  },
  {
    "id": 3,
    "titulo": "Arquitectura de Componentes",
    "descripcion": "La arquitectura basada en componentes es un paradigma de desarrollo que divide la interfaz de usuario en piezas reutilizables e independientes. Cada componente encapsula su propio estado y lógica, facilitando el mantenimiento y la escalabilidad del código.",
    "urlImagen": "https://source.unsplash.com/400x300/?architecture,components",
    "mostrarTodo": false
  },
  {
    "id": 4,
    "titulo": "Gestión del Estado",
    "descripcion": "El estado en aplicaciones móviles se refiere a los datos que cambian con el tiempo y afectan el comportamiento de la aplicación. Una gestión eficiente del estado es crucial para mantener la sincronización entre la interfaz de usuario y los datos.",
    "urlImagen": "https://source.unsplash.com/400x300/?database,management",
    "mostrarTodo": false
  },
  {
    "id": 5,
    "titulo": "Navegación en Apps Móviles",
    "descripcion": "La navegación es un aspecto fundamental en el desarrollo de aplicaciones móviles. Permite a los usuarios moverse entre diferentes pantallas de manera intuitiva y eficiente, mejorando la experiencia de usuario.",
    "urlImagen": "https://source.unsplash.com/400x300/?navigation,mobile",
    "mostrarTodo": false
  }
]